GAN_HE = {
    frozenset({'甲', '己'}): '土', frozenset({'乙', '庚'}): '金',
    frozenset({'丙', '辛'}): '水', frozenset({'丁', '壬'}): '木',
    frozenset({'戊', '癸'}): '火',
}

WUXING_SHENG = {
    ('木', '火'): True, ('火', '土'): True, ('土', '金'): True,
    ('金', '水'): True, ('水', '木'): True,
}

WUXING_KE = {
    ('木', '土'): True, ('土', '水'): True, ('水', '火'): True,
    ('火', '金'): True, ('金', '木'): True,
}

SHENG_MAP = {'木': '水', '火': '木', '土': '火', '金': '土', '水': '金'}
KE_MAP = {'木': '金', '火': '水', '土': '木', '金': '火', '水': '土'}
WO_KE_MAP = {'木': '土', '火': '金', '土': '水', '金': '木', '水': '火'}
